IDENTIFICATION DIVISION.
PROGRAM-ID. EXERCICIO1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DADOS-PRODUTO.
   05 PROD-NOME       PIC X(15) VALUE "Monitor G-Sync".
   05 PROD-VALOR      PIC 9(04)V99 VALUE 1200.00.
   05 PROD-QTD        PIC 9(02)    VALUE 03.

01 RESULTADOS.
   05 VALOR-TOTAL     PIC 9(05)V99 VALUE 0.
   05 MENSAGEM-ALERTA PIC X(30) VALUE SPACES.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "--- PROCESSAMENTO DE PRODUTO ---".
    
    | Realiza o cálculo matemático básico
    COMPUTE VALOR-TOTAL = PROD-VALOR * PROD-QTD.
    DISPLAY "Produto: " PROD-NOME.
    DISPLAY "Valor Total: R$ " VALOR-TOTAL.

    | Estrutura Condicional (IF)
    IF VALOR-TOTAL > 3000.00
        MOVE "ALERTA: Compra de alto valor!" TO MENSAGEM-ALERTA
    ELSE
        MOVE "Compra dentro do limite." TO MENSAGEM-ALERTA
    END-IF.

    DISPLAY "Status: " MENSAGEM-ALERTA.
    
    STOP RUN.