IDENTIFICATION DIVISION.
PROGRAM-ID. IDADE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 IDADE-USUARIO PIC 9(3).
01 IDADE-ED PIC Z(3).

PROCEDURE DIVISION.
DISPLAY "Digite sua idade:".
ACCEPT IDADE-USUARIO.

MOVE IDADE-USUARIO TO IDADE-ED.

IF IDADE-USUARIO >= 18
DISPLAY "Idade Informada: " IDADE-ED
DISPLAY "Voce e maior de idade."
ELSE
DISPLAY "Idade Informada: " IDADE-ED
DISPLAY "Voce e menor de idade."
END-IF.

STOP RUN.