IDENTIFICATION DIVISION.
PROGRAM-ID. LEITURA-ARQ.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-FOLHA ASSIGN TO "folha.txt"
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD ARQ-FOLHA.
01 REG-FUNCIONARIO.
   05 REG-ID        PIC 9(03).
   05 REG-NOME      PIC X(16).
   05 REG-SALARIO   PIC 9(05)V99.

WORKING-STORAGE SECTION.
01 SWITCHES.
   05 FIM-DO-ARQUIVO PIC X(01) VALUE "N".

01 EXIBICAO.
   05 SAL-EDITADO    PIC ZZZ9,99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT ARQ-FOLHA.
    
    PERFORM READ-NEXT-RECORD.
    
    PERFORM PROCESS-LOGIC 
        UNTIL FIM-DO-ARQUIVO = "S".
        
    CLOSE ARQ-FOLHA.
    STOP RUN.

READ-NEXT-RECORD.
    READ ARQ-FOLHA
        AT END MOVE "S" TO FIM-DO-ARQUIVO
    END-READ.

PROCESS-LOGIC.
    MOVE REG-SALARIO TO SAL-EDITADO.
    DISPLAY "ID: " REG-ID " | Nome: " REG-NOME " | Salario: R$ " SAL-EDITADO.
    PERFORM READ-NEXT-RECORD.